Tieken_Testi2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd">
<SOAP-ENV:Header>
<eb:MessageHeader xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" SOAP-ENV:mustUnderstand="1" eb:version="2.0">
<eb:From>
<eb:PartyId>FI2757800750155448</eb:PartyId>
<eb:Role>Sender</eb:Role>
</eb:From>
<eb:From>
<eb:PartyId>OKOYFIHH</eb:PartyId>
<eb:Role>Intermediator</eb:Role>
</eb:From>
<eb:To>
<eb:PartyId>FI2757800750155448</eb:PartyId>
<eb:Role>Receiver</eb:Role>
</eb:To>
<eb:To>
<eb:PartyId>OKOYFIHH</eb:PartyId>
<eb:Role>Intermediator</eb:Role>
</eb:To>
<eb:CPAId>yoursandmycpa</eb:CPAId>
<eb:ConversationId/>
<eb:Service>Routing</eb:Service>
<eb:Action>ProcessInvoice</eb:Action>
<eb:MessageData>
<eb:MessageId>XS1227.63Z7D2/164</eb:MessageId>
<eb:Timestamp>2004-12-27T16:15:35+02</eb:Timestamp>
<eb:RefToMessageId/>
</eb:MessageData>
</eb:MessageHeader>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<eb:Manifest eb:id="Manifest" eb:version="2.0">
<eb:Reference eb:id="Finvoice" xlink:href="XS1227.63Z7D2/164">
<eb:Schema eb:location="http://www.pankkiyhdistys.fi/verkkolasku/finvoice/finvoice.xsd" eb:version="2.0"/>
</eb:Reference>
</eb:Manifest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
<?xml version="1.0" encoding="ISO-8859-15"?>
<!-- edited with XML Spy v4.2 U (http://www.xmlspy.com) by Jussi Paasikallio (OKOBANK Group) -->
<!--Sample XML file generated by XML Spy v4.2 U (http://www.xmlspy.com)-->
<!DOCTYPE Finvoice SYSTEM "Finvoice.dtd">
<?xml-stylesheet type="text/xsl" href="Finvoice.xsl"?>
<!--Finvoice xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="C:\L\FinvoiceKehitys\Finvoice1.2\Finvoice.xsd" Version="1.1"-->
<Finvoice Version="1.1">
<SellerPartyDetails>
<SellerPartyIdentifier>9876543-2</SellerPartyIdentifier>
<SellerOrganisationName>Tieken testi</SellerOrganisationName>
<SellerOrganisationName>xxx:n yksikkö</SellerOrganisationName>
<SellerOrganisationTaxCode>9876543-2</SellerOrganisationTaxCode>
<SellerOrganisationTaxCodeUrlText>http://europa.eu.int/comm/taxation_customs/vies/fi/vieshome.htm</SellerOrganisationTaxCodeUrlText>
<SellerPostalAddressDetails>
<SellerStreetName>Kuntakatu 1</SellerStreetName>
<SellerTownName>xxxxnkunta</SellerTownName>
<SellerPostCodeIdentifier>99900</SellerPostCodeIdentifier>
</SellerPostalAddressDetails>
</SellerPartyDetails>
<SellerContactPersonName>Yhteyshenkilön nimi</SellerContactPersonName>
<SellerCommunicationDetails>
<SellerEmailaddressIdentifier>yhteys@kunta.fi</SellerEmailaddressIdentifier>
</SellerCommunicationDetails>
<SellerInformationDetails>
<SellerHomeTownName>Tieken testi</SellerHomeTownName>
<SellerPhoneNumber>(02) 12345</SellerPhoneNumber>
<SellerFaxNumber>(02) 2345678</SellerFaxNumber>
<SellerCommonEmailaddressIdentifier>laskuttaja@xxxnkunta.fi</SellerCommonEmailaddressIdentifier>
<SellerWebaddressIdentifier>www.xxxxnkunta.fi</SellerWebaddressIdentifier>
<SellerAccountDetails>
<SellerAccountID IdentificationSchemeName="IBAN">FI2757800750155448</SellerAccountID>
<SellerBic IdentificationSchemeName="BIC">OKOYFIHH</SellerBic>
</SellerAccountDetails>
<SellerAccountDetails>
<SellerAccountID IdentificationSchemeName="IBAN">FI2820012212222232</SellerAccountID>
<SellerBic IdentificationSchemeName="BIC">NDEAFIHH</SellerBic>
</SellerAccountDetails>
<SellerAccountDetails>
<SellerAccountID IdentificationSchemeName="IBAN">FI2983123331233231</SellerAccountID>
<SellerBic IdentificationSchemeName="BIC">PSPBFIHH</SellerBic>
</SellerAccountDetails>
<InvoiceRecipientDetails>
<InvoiceRecipientAddress>X12345678003</InvoiceRecipientAddress>
<InvoiceRecipientIntermediatorAddress>OKOYFIHH</InvoiceRecipientIntermediatorAddress>
</InvoiceRecipientDetails>
</SellerInformationDetails>
<BuyerPartyDetails>
<BuyerPartyIdentifier>FI1234567-8</BuyerPartyIdentifier>
<BuyerOrganisationName>Ostaja Oy</BuyerOrganisationName>
<BuyerPostalAddressDetails>
<BuyerStreetName>Rauhalantie 8</BuyerStreetName>
<BuyerTownName>VANTAA</BuyerTownName>
<BuyerPostCodeIdentifier>01700</BuyerPostCodeIdentifier>
</BuyerPostalAddressDetails>
</BuyerPartyDetails>
<DeliveryPartyDetails>
<DeliveryPartyIdentifier/>
<DeliveryOrganisationName>Kunnan koulu</DeliveryOrganisationName>
<DeliveryPostalAddressDetails>
<DeliveryStreetName>Koulutie 5</DeliveryStreetName>
<DeliveryTownName>Tieken testi</DeliveryTownName>
<DeliveryPostCodeIdentifier>99900</DeliveryPostCodeIdentifier>
</DeliveryPostalAddressDetails>
</DeliveryPartyDetails>
<DeliveryDetails>
<DeliveryDate Format="CCYYMMDD">20040910</DeliveryDate>
<DeliveryMethodText>autokuljetus</DeliveryMethodText>
</DeliveryDetails>
<InvoiceDetails>
<InvoiceTypeCode>INV01</InvoiceTypeCode>
<InvoiceTypeText>LASKU</InvoiceTypeText>
<OriginCode>Original</OriginCode>
<InvoiceNumber>164</InvoiceNumber>
<InvoiceDate Format="CCYYMMDD">20040615</InvoiceDate>
<OrderIdentifier>ostajan viite</OrderIdentifier>
<InvoiceTotalVatExcludedAmount AmountCurrencyIdentifier="EUR">132,75</InvoiceTotalVatExcludedAmount>
<InvoiceTotalVatAmount AmountCurrencyIdentifier="EUR">29,21</InvoiceTotalVatAmount>
<InvoiceTotalVatIncludedAmount AmountCurrencyIdentifier="EUR">161,96</InvoiceTotalVatIncludedAmount>
<VatSpecificationDetails>
<VatBaseAmount AmountCurrencyIdentifier="EUR">132,75</VatBaseAmount>
<VatRatePercent>22</VatRatePercent>
<VatRateAmount AmountCurrencyIdentifier="EUR">29,21</VatRateAmount>
</VatSpecificationDetails>
<PaymentTermsDetails>
<PaymentTermsFreeText>10 p netto</PaymentTermsFreeText>
<InvoiceDueDate Format="CCYYMMDD">20040625</InvoiceDueDate>
<PaymentOverDueFineDetails>
<PaymentOverDueFineFreeText>Viivästyskorko 10,5</PaymentOverDueFineFreeText>
<PaymentOverDueFinePercent>10,5</PaymentOverDueFinePercent>
</PaymentOverDueFineDetails>
</PaymentTermsDetails>
</InvoiceDetails>
<PaymentStatusDetails>
<PaymentStatusCode>NOTPAID</PaymentStatusCode>
</PaymentStatusDetails>
<InvoiceRow>
<RowFreeText>Lisätiedot: Tässä testataan yksinkertaista laskua.</RowFreeText>
</InvoiceRow>
<InvoiceRow>
<ArticleIdentifier>12345</ArticleIdentifier>
<ArticleName>Tuotteen nimi xx</ArticleName>
<DeliveredQuantity QuantityUnitCode="kpl">5</DeliveredQuantity>
<UnitPriceAmount AmountCurrencyIdentifier="EUR">3,05</UnitPriceAmount>
<RowVatRatePercent>22</RowVatRatePercent>
<RowVatAmount AmountCurrencyIdentifier="EUR">3,36</RowVatAmount>
<RowVatExcludedAmount AmountCurrencyIdentifier="EUR">15,25</RowVatExcludedAmount>
<RowAmount AmountCurrencyIdentifier="EUR">18,61</RowAmount>
</InvoiceRow>
<InvoiceRow>
<ArticleIdentifier>12346</ArticleIdentifier>
<ArticleName>Tuotteen nimi yy</ArticleName>
<DeliveredQuantity QuantityUnitCode="kpl">10</DeliveredQuantity>
<UnitPriceAmount AmountCurrencyIdentifier="EUR">11,75</UnitPriceAmount>
<RowVatRatePercent>22</RowVatRatePercent>
<RowVatAmount AmountCurrencyIdentifier="EUR">25,85</RowVatAmount>
<RowVatExcludedAmount AmountCurrencyIdentifier="EUR">117,50</RowVatExcludedAmount>
<RowAmount AmountCurrencyIdentifier="EUR">143,35</RowAmount>
</InvoiceRow>
<EpiDetails>
<EpiIdentificationDetails>
<EpiDate Format="CCYYMMDD">20041227</EpiDate>
<EpiReference>2004538</EpiReference>
</EpiIdentificationDetails>
<EpiPartyDetails>
<EpiBfiPartyDetails>
<EpiBfiIdentifier IdentificationSchemeName="BIC">OKOYFIHH</EpiBfiIdentifier>
</EpiBfiPartyDetails>
<EpiBeneficiaryPartyDetails>
<EpiNameAddressDetails>Tieken testi</EpiNameAddressDetails>
<EpiBei>9876543-2</EpiBei>
<EpiAccountID IdentificationSchemeName="BBAN">50001520000081</EpiAccountID>
</EpiBeneficiaryPartyDetails>
</EpiPartyDetails>
<EpiPaymentInstructionDetails>
<EpiRemittanceInfoIdentifier IdentificationSchemeName="SPY">00000000000002004538</EpiRemittanceInfoIdentifier>
<EpiInstructedAmount AmountCurrencyIdentifier="EUR">161,96</EpiInstructedAmount>
<EpiCharge ChargeOption="SHA">SHA</EpiCharge>
<EpiDateOptionDate Format="CCYYMMDD">20040625</EpiDateOptionDate>
</EpiPaymentInstructionDetails>
</EpiDetails>
</Finvoice>
